Revit 2027 API
ConfigurationReloadInfo.GetCustomDataChangedElements Method
 Gets a list of ElementIds of fabrication parts that had custom data updated during the reload.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetCustomDataChangedElements()
Public Function GetCustomDataChangedElements As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetCustomDataChangedElements()
member GetCustomDataChangedElements : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
 A list identifying changed elements.
See Also
Reference
ConfigurationReloadInfo Class
Autodesk.Revit.DB Namespace